#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
  
```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.fiap_burger_identity: Reading...
data.terraform_remote_state.fiap_burger_eks: Reading...
data.terraform_remote_state.fiap_burger_identity: Read complete after 0s
data.terraform_remote_state.fiap_burger_eks: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.fiap_burger will be created
  + resource "aws_apigatewayv2_api" "fiap_burger" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "fiap_burger"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # aws_apigatewayv2_integration.fiap_burger_identity_integration will be created
  + resource "aws_apigatewayv2_integration" "fiap_burger_identity_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:913112958085:function:fiap_burger_identity/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.fiap_burger_order will be created
  + resource "aws_apigatewayv2_integration" "fiap_burger_order" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:913112958085:listener/net/a0076379ffec444c4958f1a0f8574f09/4b794a8ed5e388ba/dcf18a2e55a9b0f4"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.fiap_burger_payments will be created
  + resource "aws_apigatewayv2_integration" "fiap_burger_payments" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:913112958085:listener/net/a0530e19b437a416cab20d7a833cfd6a/de43f0dd176160c4/a88c47889fb216a8"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.fiap_burger_preparation will be created
  + resource "aws_apigatewayv2_integration" "fiap_burger_preparation" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:913112958085:listener/net/a36ce04dedbe6426ca31cdfaf5fa5fdb/06539f8f251b9e97/1debc50c02311805"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_order_add_item will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_order_add_item" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "PUT /fiap-burger-order/v1/orders/{id}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_order_checkout will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_order_checkout" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /fiap-burger-order/v1/orders/{id}/checkout"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_order_complete will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_order_complete" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /fiap-burger-order/v1/orders/{id}/complete"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_order_create will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_order_create" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /fiap-burger-order/v1/orders"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_order_find will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_order_find" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /fiap-burger-order/v1/orders"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_order_follow_up will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_order_follow_up" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /fiap-burger-order/v1/orders-follow-up"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_order_get will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_order_get" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /fiap-burger-order/v1/orders/{id}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_order_remove_item will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_order_remove_item" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "PATCH /fiap-burger-order/v1/orders/{id}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_payments_approve will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_payments_approve" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "PATCH /fiap-burger-payments/v1/payments/{id}/approve"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_payments_reject will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_payments_reject" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "PATCH /fiap-burger-payments/v1/payments/{id}/reject"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_preparation_advance will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_preparation_advance" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "PATCH /fiap-burger-preparation/v1/preparations/{id}/advance"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_preparation_find will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_preparation_find" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "PATCH /fiap-burger-preparation/v1/preparations"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_burger_preparation_get will be created
  + resource "aws_apigatewayv2_route" "fiap_burger_preparation_get" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "PATCH /fiap-burger-preparation/v1/preparations/{id}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.proxy_handler will be created
  + resource "aws_apigatewayv2_route" "proxy_handler" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /identity"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.dev will be created
  + resource "aws_apigatewayv2_stage" "dev" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "dev"
      + tags_all      = (known after apply)
    }

  # aws_apigatewayv2_vpc_link.fiap_burger_eks will be created
  + resource "aws_apigatewayv2_vpc_link" "fiap_burger_eks" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "fiap-burger-eks"
      + security_group_ids = (known after apply)
      + subnet_ids         = [
          + "subnet-04054a99c15d29ba3",
          + "subnet-083e2314a3bad4226",
        ]
      + tags_all           = (known after apply)
    }

  # aws_lambda_permission.api_gtw will be created
  + resource "aws_lambda_permission" "api_gtw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "fiap_burger_identity"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_security_group.vpc_link will be created
  + resource "aws_security_group" "vpc_link" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "fiap-burger-k8s-vpc-link"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0c6b85e392b98576f"
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + apigateway_execution_arn = (sensitive value)
  + apigateway_id            = (sensitive value)
  + apigateway_url           = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
  
</details>

*Pusher: @gm50x*
*Action: `pull_request`*
*Workflow: `Terraform IAC - API Gateway`*